import 'package:personnel_management_flutter/models/news_item.dart';

final news = [
  News(
    id: 'n1',
    imageUrl: 'assets/images/Image-n1.jpg',
    title:
        'Лидерство в IT: Как эффективно руководить командой разработчиков и IT-специалистов.',
    description:
        'В современном мире информационных технологий, лидерство играет важную роль в успешной работе  ...',
    date: DateTime(2023, 3, 4, 13, 0),
  ),
  News(
    id: 'n2',
    imageUrl: 'assets/images/Image-n2.jpg',
    title:
        'Стратегическое управление в IT: Как разработать и реализовать стратегию для компании.',
    description:
        'Стратегическое управление в IT является неотъемлемой частью успеха любой компании в сфере информационных...',
    date: DateTime(2025, 1, 30, 15, 0),
  ),
  News(
    id: 'n3',
    imageUrl: 'assets/images/Image-n3.jpg',
    title:
        'Управление проектами: Как эффективно планировать, организовывать и контролировать проекты в IT сфере.',
    description:
        'Перед тем как приступить к управлению проектами, важно понять основные концепции и термины, связанные ...',
    date: DateTime(2025, 1, 20, 15, 0),
  ),
  News(
    id: 'n4',
    imageUrl: 'assets/images/Image-n4.jpg',
    title:
        'Инновации в IT: Как стимулировать инновационное мышление и развивать новые технологические решения.',
    description:
        'Инновации являются движущей силой в сфере информационных технологий. Они позволяют компаниям ....',
    date: DateTime(2025, 1, 15, 15, 0),
  ),
  News(
    id: 'n5',
    imageUrl: 'assets/images/Image-n5.jpg',
    title:
        'Управление изменениями в IT: Как эффективно внедрять изменения в IT компании и минимизировать сопротивление сотрудников.',
    description:
        'Управление изменениями является неотъемлемой частью развития и успеха IT компаний. Внедрение изменений мою ...',
    date: DateTime(2025, 1, 10, 11, 0),
  ),
];
